docs/2020/slack-reminder-format.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Slack reminder の日付け書き方サンプル集</title>
<meta name="author" content="clothoid" />
<meta name="keywords" content="slack bot reminder date auto schedule" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Slack reminder の日付け書き方サンプル集</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12e21a5">1. 具体例</a></li>
<li><a href="#org4b5541f">2. 背景</a></li>
</ul>
</div>
</div>

<div id="outline-container-org12e21a5" class="outline-2">
<h2 id="org12e21a5"><span class="section-number-2">1.</span> 具体例</h2>
<div class="outline-text-2" id="text-1">
<p>
slack の標準機能である /reminder のフォーマット
</p>

<div class="org-src-container">
<pre class="src src-slack">/remind [@someone or #channel or me] "[what]" [when]
</pre>
</div>

<p>
の [when] の英語書き方リスト。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">意味</th>
<th scope="col" class="org-left">書き方</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">毎日 9:00に</td>
<td class="org-left">everyday<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
</tr>

<tr>
<td class="org-left">毎日 20:00に</td>
<td class="org-left">at 8PM everyday</td>
</tr>

<tr>
<td class="org-left">毎平日 9:20 に</td>
<td class="org-left">at 09:20AM every weekday</td>
</tr>

<tr>
<td class="org-left">毎週木曜日 16:00 に</td>
<td class="org-left">at 16:00 every Thursday</td>
</tr>

<tr>
<td class="org-left">毎月15日の 19:00 に</td>
<td class="org-left">at 19:00 on the 15th of every month</td>
</tr>

<tr>
<td class="org-left">月初の 9:00 に <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
<td class="org-left">on the 1st of every month <sup><a id="fnr.1.100" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
</tr>

<tr>
<td class="org-left">次の 火曜日の 午前9時に</td>
<td class="org-left">at 9am on Tuesday</td>
</tr>

<tr>
<td class="org-left">次の 3月1日の 21:55 分に</td>
<td class="org-left">at 9:55pm on March 1st</td>
</tr>

<tr>
<td class="org-left">次の 3月2日の 正午に</td>
<td class="org-left">at noon on March 2nd</td>
</tr>

<tr>
<td class="org-left">明日の 18時に</td>
<td class="org-left">at 6pm tomorrow</td>
</tr>

<tr>
<td class="org-left">明後日の 9:00 に <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></td>
<td class="org-left">the day after tomorrow <sup><a id="fnr.1.100" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></td>
</tr>

<tr>
<td class="org-left">45 分後に</td>
<td class="org-left">in 45 minutes</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org4b5541f" class="outline-2">
<h2 id="org4b5541f"><span class="section-number-2">2.</span> 背景</h2>
<div class="outline-text-2" id="text-2">
<p>
slack の標準機能である /reminder のフォーマットは以下のとおりである。
</p>

<div class="org-src-container">
<pre class="src src-slack">/remind [@someone or #channel or me] "[what]" [when]
</pre>
</div>

<p>
したがって、例えば
</p>

<div class="org-src-container">
<pre class="src src-slack">/remind me "coffee time" at 15:00 
</pre>
</div>

<p>
とすると、15 時に coffee time とリマインダをしてくれる。
ある程度日本語にも対応していて、例えば
</p>

<div class="org-src-container">
<pre class="src src-slack">/remind 自分 "コーヒー休憩" at 15
</pre>
</div>

<p>
とすると、15 時に コーヒー休憩とリマインダをしてくれる。
ただし、完璧に日本語には対応しておらず、例えば、
</p>

<div class="org-src-container">
<pre class="src src-slack">/remind 自分 "コーヒー休憩" 午後3時に
</pre>
</div>

<p>
などはエラーで弾かれる(&lt;Fri Mar 27 15:17:59 2020&gt; 現在)。
</p>

<p>
Slack の公式ヘルプにも
</p>

<blockquote>
<p>
Slack を別の言語で使用している場合、自分の言語でリマインダーを作成できますが、日時の入力形式は英語のリマインダーの設定方法に従うことをお勧めします。
</p>
</blockquote>

<p>
と記載している<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>。
</p>

<p>
したがって、[when] 部分のみは英語表記で書いた方が望ましく、かつ、英語の日付け表記は難しく、かつ、<a href="https://qiita.com/naoyama88/items/b215e673bd2f6fb331f9">slackのremind機能書き方まとめ</a> が消えてしまった。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
時間を省略した場合は午前 9 時となる 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
月末の end of month や last day of month などは通じず <a href="https://github.com/sandst1/lastdayofmonth">こんなもの</a>があったが、未確認 &lt;Fri Mar 27 15:44:28 2020&gt;
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
明々後日の  two days after tomorrow は通じなかった &lt;Fri Mar 27 15:33:49 2020&gt;
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://slack.com/intl/ja-jp/help/articles/208423427-%E3%83%AA%E3%83%9E%E3%82%A4%E3%83%B3%E3%83%80%E3%83%BC%E3%82%92%E8%A8%AD%E5%AE%9A%E3%81%99%E3%82%8B">リマインダーを設定する</a> の[気をつけてほしいこと] &lt;Fri Mar 27 15:19:41 2020&gt;
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
